@regression
Feature: Бронирование столиков в ресторане Vecher

  Background:
    Given в ресторане есть столик с номером 1 вместимостью 4

  @smoke
  Scenario: Успешное бронирование столика
#    Given в ресторане есть столик с номером 1 вместимостью 4
    Given в ресторане есть столики:
      | номер | вместимость |
      | 1     | 2           |
      | 2     | 4           |
      | 3     | 6           |
    When гость бронирует столик на 2 человека и 1 время
    Then бронирование успешно создано

  @negative
  Scenario: Отказ в бронировании из-за недостаточной вместимости
#    Given в ресторане есть столик с номером 1 вместимостью 4
    When гость бронирует столик на 6 человека и 1 время
    Then бронирование успешно отклонено

  Scenario: Отмена ранее сделанного бронирования
#    Given в ресторане есть столик с номером 1 вместимостью 4
    When гость бронирует столик на 2 человека и 1 время
    And гость отменяет своё бронирование
    Then бронирование успешно отменено

#    Блок 3
  Scenario Outline: Бронирование столика
    Given в ресторане есть столик с номером <num> вместимостью <capacity>
    When гость бронирует столик на 3 человека и 1 время
    Then бронирование успешно <result>

    Examples:
    | num   | capacity  | result    |
    | 1     | 2         | создано   |
    | 2     | 3         | создано   |
    | 2     | 3         | отклонено |
    | 4     | 4         | отклонено |

    #    Блок 5
  Scenario: Бронирование с особым пожеланием
    Given в ресторане есть столик с номером 5 вместимостью 4
    When гость бронирует столик на 2 человека и 1 время
    And гость оставляет пожелание к брони:
      """
      Пожалуйста, столик подальше от кухни,
      у вас там пахнет болотом.
      """
    Then бронирование успешно создано